/**
 * 課題①
 * ブリとかつおをコンソールに出力してください。
 */
const sushi = [
  "サーモン",
  "まぐろ",
  "ブリ",
  "いくら",
  "いか",
  "かつお",
  "たまご",
]

// 回答欄


///////////////////////////////////////////////////////////////////////////////

/**
 * 課題②
 * ゴタさんのnameとageをコンソールに出力してください。
 */
const profile = {
  name: "ゴタ",
  age: 17,
  hobby: "寝ること",
}

// 回答欄


///////////////////////////////////////////////////////////////////////////////

/**
 * 課題③
 * ななかさんのnameとageをコンソールに出力してください。
 */
const profiles = [
  {
    name: "ナツタ",
    age: 15,
    hobby: "寝ること",
  },
  {
    name: "かずき",
    age: 25,
    hobby: "プログラミング",
  },
  {
    name: "ななか",
    age: 24,
    hobby: "ハロプロ",
  },
]

// 回答欄


/**
 * 課題④
 * とんこつとコーラとソフトクリームをコンソールに出力してください。
 */
const menu = [
  "ステーキ",
  "焼き魚",
  "サラダ",
  { "ラーメン": ["醤油", "味噌", "とんこつ"] },
  ["コーラ", "オレンジジュース", "紅茶"],
  { sweets: ["チーズケーキ", ["ジェラート", "ソフトクリーム"], "プリン"] },
]

// 回答欄


///////////////////////////////////////////////////////////////////////////////

/**
 * 課題⑤
 * "紅茶"を"ミルクティー"に変更してください。
 * 変更後にミルクティーをコンソールに出力してください。
 */
let drink = [
  "コーラ",
  "オレンジジュース",
  "紅茶"
]


// 回答欄


///////////////////////////////////////////////////////////////////////////////

/**
 * 課題⑥
 * "プリン"の価格を1500に値上げしてください。
 * 変更後にプリンの価格をコンソールに出力してください。
 */
let price = {
  "チーズケーキ": 500,
  "プリン": 1000,
  "ジェラート": 2000,
}

// 回答欄


///////////////////////////////////////////////////////////////////////////////
